deepfreeze/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-12 Thu 17:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs</title>
<meta name="author" content="Bill Wear" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="custom.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">emacs</h1>
<p>
Emacs is not just a text editor; it’s a dynamic ecosystem and a philosophy of <b>freedom</b>, <b>automation</b>, <b>adaptability</b>, and <b>community</b>. My <code>.emacs</code> configuration is a reflection of these values, tailored to streamline my workflow, manage my goals, and keep everything synchronized across devices. By looking at the way I handle git automation, use Org-mode files to manage my life, and integrate tools like Treemacs, Company, and Ivy, we can see how Emacs becomes an essential tool for maintaining both personal and professional efficiency.
</p>

<div id="outline-container-org0ac54da" class="outline-2">
<h2 id="org0ac54da">Freedom Through Customization</h2>
<div class="outline-text-2" id="text-org0ac54da">
<p>
Freedom is at the heart of Emacs. Unlike rigid tools with fixed workflows, Emacs empowers users to shape their environment to meet their needs. My <code>.emacs</code> file is more than just a configuration; it’s a personal declaration of independence. I set my home directory to <code>~/bill</code>, a persistent workspace that travels with me across platforms.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq hdir "~/bill")
(setq git-repo-url "git@gitlab.com:billwear/root.git")
(setq default-directory hdir)
</pre>
</div>

<p>
This persistent setup ensures that wherever I work — be it on my desktop, laptop, or Termux on Android — I’m always in familiar territory. The freedom to create a consistent environment across devices means I can focus on my work, not on configuring new setups.
</p>

<p>
My <code>~/bill</code> directory mirrors the Unix home directory structure I’ve been using for over 50 years. This design keeps things intuitive and organized:
</p>

<ul class="org-ul">
<li><b><b><code>~/bill/etc/org/</code></b></b>: For Org-mode files and configurations.</li>
<li><b><b><code>~/bill/usr/projects/</code></b></b>: For development work and personal projects.</li>
<li><b><b><code>~/bill/var/www/</code></b></b>: For my website files.</li>
</ul>

<p>
This structure reinforces consistency and simplicity, principles that have guided me throughout my life.
</p>
</div>
</div>

<div id="outline-container-orgec88ada" class="outline-2">
<h2 id="orgec88ada">Automation: The System Works for Me</h2>
<div class="outline-text-2" id="text-orgec88ada">
<p>
Automation is a core value that keeps me efficient and focused. One of the most powerful automations in my workflow is git synchronization. Keeping my configuration and notes synchronized across devices is critical, but I take a careful approach: I always check for changes before committing. This practice ensures that I have full control and awareness of what’s being synchronized.
</p>
</div>

<div id="outline-container-orgbefd4cf" class="outline-3">
<h3 id="orgbefd4cf">Why Check for Changes?</h3>
<div class="outline-text-3" id="text-orgbefd4cf">
<p>
Checking for changes before committing prevents unwanted or erroneous updates from propagating through my workflow. It helps me avoid conflicts, identify unintended modifications, and maintain a clean and organized repository. Automation is powerful, but mindful automation — where I’m aware of the system’s actions — is even more effective.
</p>
</div>
</div>

<div id="outline-container-org8f6f181" class="outline-3">
<h3 id="org8f6f181">Auto-Sync Function</h3>
<div class="outline-text-3" id="text-org8f6f181">
<p>
Here's the function that handles the process of checking, committing, pulling, and pushing changes:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my/git-auto-sync ()
  "Auto-sync function to pull, merge, and push changes with proper checks."
  (interactive)
  (save-some-buffers t)
  (let ((default-directory hdir))
    ;; Check for uncommitted changes
    (if (not (string-empty-p (shell-command-to-string "git status --porcelain")))
        (progn
          (message "Uncommitted changes detected. Committing changes...")
          (shell-command "git add .")
          (shell-command "git commit -m 'Auto-commit before sync'")
          (message "Changes committed successfully."))
      (message "No changes to commit."))

    ;; Pull latest changes (merge instead of rebase)
    (if (zerop (shell-command "git pull --no-rebase origin main"))
        (progn
          (message "Pulled latest changes successfully.")
          (shell-command "git push origin main")
          (message "Pushed changes successfully."))
      (message "Error during git pull. Resolve conflicts manually."))))
</pre>
</div>

<p>
This ensures that my work is always up-to-date and consistent across devices, reducing the mental load of remembering to sync manually.
</p>
</div>
</div>
</div>

<div id="outline-container-org495ef9d" class="outline-2">
<h2 id="org495ef9d">Managing Life with Org-mode</h2>
<div class="outline-text-2" id="text-org495ef9d">
<p>
Emacs becomes even more powerful with Org-mode, a system for organizing tasks, notes, and schedules. Inspired by Tom Limoncelli’s <a href="https://www.amazon.com/Time-Management-System-Administrators-Working/dp/0596007833">Time Management for System Administrators</a>, I use three primary Org-mode files: <code>life-goals.org</code>, <code>todo.org</code>, and <code>calendar.org</code>. These files help me plan, prioritize, and execute tasks effectively.
</p>
</div>

<div id="outline-container-org4ea6b7b" class="outline-3">
<h3 id="org4ea6b7b">The Three Key Files</h3>
<div class="outline-text-3" id="text-org4ea6b7b">
<ol class="org-ol">
<li><b><b><code>life-goals.org</code></b></b>: This file contains my long-term objectives and overarching ambitions. It’s where I break down my goals into manageable steps and track my progress. Having a clear view of my life goals keeps me anchored and ensures that my daily work aligns with what truly matters to me.</li>

<li><b><b><code>todo.org</code></b></b>: This file is my central hub for day-to-day tasks. It’s a running list of everything I need to do, categorized by priority and context. Whether it’s a simple errand or a complex work project, <code>todo.org</code> helps me stay on top of it all. Tasks are regularly reviewed and updated to keep me productive and focused.</li>

<li><b><b><code>calendar.org</code></b></b>: This file helps me manage time-sensitive tasks, appointments, and deadlines. It acts as a bridge between my goals and my schedule, ensuring that important commitments are honored. By keeping track of deadlines and events, I can allocate my time wisely.</li>
</ol>
</div>
</div>

<div id="outline-container-org6510952" class="outline-3">
<h3 id="org6510952">Configuration File for Org-Agenda</h3>
<div class="outline-text-3" id="text-org6510952">
<p>
Instead of hardcoding these files directly in my <code>.emacs</code>, I use a separate configuration file to load them. This keeps my main configuration clean and modular. Here’s how I set up the Org-agenda files:
</p>

<p>
In a separate <code>org-config.el</code> file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-agenda-files '("~/bill/etc/org/life-goals.org"
                         "~/bill/etc/org/todo.org"
                         "~/bill/etc/org/calendar.org"))
</pre>
</div>

<p>
In my <code>.emacs</code> file, I load this configuration:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(load "~/bill/etc/org-config.el")
</pre>
</div>

<p>
This modular approach keeps my configuration organized and makes it easy to update or expand my Org-agenda setup without cluttering the main <code>.emacs</code> file.
</p>
</div>
</div>
</div>

<div id="outline-container-org1861aa7" class="outline-2">
<h2 id="org1861aa7">Efficiency Through Treemacs, Company, and Ivy</h2>
<div class="outline-text-2" id="text-org1861aa7">
<p>
Emacs thrives on tools that enhance efficiency by reducing cognitive load. Three key tools in my setup are Treemacs, Company, and Ivy.
</p>
</div>

<div id="outline-container-org4d3dc8d" class="outline-3">
<h3 id="org4d3dc8d">Treemacs</h3>
<div class="outline-text-3" id="text-org4d3dc8d">
<p>
Treemacs is a powerful file and project explorer that keeps my workspace organized and accessible. With Treemacs, I can navigate my projects visually, reducing the need to remember deep directory paths.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package treemacs
  :config
  (setq treemacs-width 30))
</pre>
</div>
</div>
</div>

<div id="outline-container-org734ca04" class="outline-3">
<h3 id="org734ca04">Company Mode</h3>
<div class="outline-text-3" id="text-org734ca04">
<p>
Company mode provides intelligent, context-aware autocompletion. Whether I’m writing code, text, or configuration files, Company helps me type faster and more accurately by suggesting completions, sparing me the effort of remembering exact syntax.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package company
  :config
  (global-company-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a30f22" class="outline-3">
<h3 id="org9a30f22">Ivy and Counsel</h3>
<div class="outline-text-3" id="text-org9a30f22">
<p>
Ivy and Counsel streamline command and file completion, making it faster to find and open files, run commands, and search through buffers. With these tools, I reduce the mental burden of remembering long command names or file paths.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy :config (ivy-mode 1))
(use-package counsel :config (counsel-mode))
</pre>
</div>

<p>
These tools work together to create an environment where the mechanics of work fade into the background, letting me focus on what matters most.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd95d4f4" class="outline-2">
<h2 id="orgd95d4f4">Conclusion: Emacs as a Way of Life</h2>
<div class="outline-text-2" id="text-orgd95d4f4">
<p>
Emacs is more than just a tool — it’s a way of life. It represents freedom, automation, adaptability, and continuous improvement. Through thoughtful customization, automated synchronization, and effective planning with Org-mode, Emacs helps me manage both my work and personal life with clarity and efficiency.
</p>

<p>
By combining git automation, a Unix-inspired directory structure, and powerful tools like Treemacs, Company, and Ivy, Emacs becomes a partner in the pursuit of simplicity, efficiency, and growth. This system isn’t static; it evolves with me. My <code>.emacs</code> file is a living document that reflects my values and adapts to my needs.
</p>

<p>
In embracing Emacs, I embrace a philosophy of deliberate, thoughtful work — a journey of exploration, resilience, and authenticity that never truly ends.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bill Wear</p>
<p class="date">Created: 2024-12-12 Thu 17:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
